Catalogs/ЭлектронныеГлоссарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЭлектронныеГлоссарии</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьСсылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьКоманду</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Термины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Термин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТерминыЭлектронныхГлоссариев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздаватьСсылки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСсылок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТерминыЭлектронныхГлоссариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТерминыЭлектронныхГлоссариев</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БукваДляПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Определение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОпределение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Синонимы</Name>
					<Comment>Синонимы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БукваДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭлектронныеГлоссарии/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает группу, в которой хранятся элементы глоссария.
// В случае ее отсутствия, создает новую.
//
Функция ГруппаПодчиненныхЭлементов(Знач Глоссарий, Знач ТипПодчиненногоЭлемента, Знач ЭлектронныйРесурс = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Глоссарий)
		ИЛИ НЕ ЗначениеЗаполнено(ТипПодчиненногоЭлемента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ГруппаПодчиненныхЭлементов = РегистрыСведений.ГруппыЭлементовЭлектронныхКурсов.ГруппаДляХраненияПодчиненныхЭлементов(Глоссарий, ТипПодчиненногоЭлемента);
	
	Если ГруппаПодчиненныхЭлементов = Неопределено Тогда
		
		ИмяСправочника = Метаданные.НайтиПоТипу(ТипПодчиненногоЭлемента).Имя;
		
		НоваяГруппаОбъект =  Справочники[ИмяСправочника].СоздатьГруппу();
		НоваяГруппаОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Глоссарий, "Наименование");
	
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			НоваяГруппаОбъект.Родитель = Справочники.ЭлектронныеКурсы.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, ТипПодчиненногоЭлемента);	
		КонецЕсли;
		
		РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(НоваяГруппаОбъект);

		НоваяГруппаОбъект.Записать();
		
		ГруппаПодчиненныхЭлементов = НоваяГруппаОбъект.Ссылка;
		
		РегистрыСведений.ГруппыЭлементовЭлектронныхКурсов.СохранитьГруппуДляХраненияПодчиненныхЭлементов(Глоссарий, ГруппаПодчиненныхЭлементов);		
				
	КонецЕсли;

	Возврат ГруппаПодчиненныхЭлементов;

КонецФункции

Функция Термины(Знач Глоссарий, ВключатьПомеченныеНаУдаление = Истина, ВключатьОпределение = Ложь) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Термины.Наименование КАК Наименование,
		|	Термины.КраткоеОпределение КАК КраткоеОпределение,
		|	Термины.Ссылка КАК Термин,
		|	ТерминыГлоссария.СоздаватьСсылки КАК СоздаватьСсылки,
		|	ТерминыГлоссария.КоличествоСсылок КАК КоличествоСсылок,
		|	Термины.БукваДляПоиска КАК БукваДляПоиска,
		|	&ПутьКОпределению КАК Определение
		|ИЗ
		|	Справочник.ЭлектронныеГлоссарии.Термины КАК ТерминыГлоссария
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТерминыЭлектронныхГлоссариев КАК Термины
		|		ПО ТерминыГлоссария.Термин = Термины.Ссылка
		|ГДЕ
		|	Термины.ЭтоГруппа = ЛОЖЬ
		|	И ТерминыГлоссария.Ссылка = &Глоссарий
		|	И &ОтборПомеченныхНаУдаление";
	
	Если ВключатьПомеченныеНаУдаление Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПомеченныхНаУдаление", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПомеченныхНаУдаление", "Термины.ПометкаУдаления = ЛОЖЬ");
	КонецЕсли;
	
	Если ВключатьОпределение Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПутьКОпределению", "Термины.Определение");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПутьКОпределению", "NULL");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Глоссарий", Глоссарий);	
	
	ТаблицаТерминов = Запрос.Выполнить().Выгрузить();
	
	ТаблицаТерминов.Колонки.Добавить("Синонимы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТерминыЭлектронныхГлоссариевСинонимы.Представление КАК Представление,
		|	ТерминыЭлектронныхГлоссариевСинонимы.Ссылка КАК Термин,
		|	ТерминыЭлектронныхГлоссариевСинонимы.БукваДляПоиска КАК БукваДляПоиска
		|ИЗ
		|	Справочник.ТерминыЭлектронныхГлоссариев.Синонимы КАК ТерминыЭлектронныхГлоссариевСинонимы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭлектронныеГлоссарии.Термины КАК ЭлектронныеГлоссарииТермины
		|		ПО ТерминыЭлектронныхГлоссариевСинонимы.Ссылка = ЭлектронныеГлоссарииТермины.Термин
		|ГДЕ
		|	ЭлектронныеГлоссарииТермины.Ссылка = &Глоссарий";
	
	Запрос.УстановитьПараметр("Глоссарий", Глоссарий);
	
	ТаблицаСинонимов = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТТ Из ТаблицаТерминов Цикл
			
		Синонимы = ТаблицаСинонимов.НайтиСтроки(Новый Структура("Термин", СтрокаТТ.Термин));
		
		СтрокаТТ.Синонимы = Новый Массив;
		Для каждого СтрокаС Из Синонимы Цикл
			СтрокаТТ.Синонимы.Добавить(Новый Структура("Представление, БукваДляПоиска", СтрокаС.Представление, СтрокаС.БукваДляПоиска));
		КонецЦикла;
				
	КонецЦикла;
	
	Возврат ТаблицаТерминов;
	
КонецФункции

#КонецОбласти


#КонецЕсли
